#include "data_transfer.h"
#include "control.h"

u32 buff[5];	//数据存储数组	
			//buff[0]	识别符
			//buff[1]	数据1
			//buff[2]	数据2
			//buff[3]	数据3
			//buff[4]	数据4
			
void Data_Analyze(void)
{
	u32 Data = 0;
	
	Data = (buff[1] << 24) + (buff[2] << 16) + (buff[3] << 8) + buff[4];
	
	switch(buff[0])
	{
		case 1:
			kp = Data;
			break;
		case 2:
			kd = Data;
			break;
		default:
			break;
	}
}

//此函数在中断中调用
void Receive_Handle(u8 ch)
{
	/*
		由于STM32的串口是8位口（配置为8位口），u32的变量无法一次性发送，用ascii码发送接收还涉及到解码问题，
		初版的数据传递均采用16进制数（hex）的形式进行。
		8位能传递的数值取值为0x00~0xFF。
	
		u32	0x00000000	~	0xFFFFFFFF
		u8	0x00		~	0xFF
	
		需要分四次传完，传递顺序参考书写顺序
		高8位->次高8位->中低8位->低8位
	
		例：0x12345678 传递顺序：0x12->0x34->0x56->0x78
	*/
	
	/*
		长度：		7 Byte
	
		Byte1	包头		0xAA
		Byte2	识别符		1~255
		Byte3	内容1
		Byte4	内容2
		Byte5	内容3
		Byte6	内容4
		Byte7	包尾		0xBB
		
	*/

	static u8 number = 0;
	
	switch(number)
	{
	//*******************************************************************************
		case 0:
			if(ch == 0xAA)	//如果收到包头，则开始接收
				number = 1;
			break;
	//*******************************************************************************
		case 1:
			buff[0] = ch;	//识别符
			number = 2;
			break;
	//*******************************************************************************
		case 2:
			buff[1] = ch;	//数据1
			number = 3;
			break;
	//*******************************************************************************
		case 3:
			buff[2] = ch;	//数据2
			number = 4;
			break;
	//*******************************************************************************
		case 4:
			buff[3] = ch;	//数据3
			number = 5;
			break;
	//*******************************************************************************
		case 5:
			buff[4] = ch;	//数据4
			number = 6;
			break;
	//*******************************************************************************
		case 6:
			if(ch == 0xBB)	//正确收到包尾
			{
				
				Data_Analyze();	//调用数据分析解码函数
				number = 0;				
			}
			else	//没有收到包尾，舍弃所有数据，归零
			{
				number = 0;
			}
	//*******************************************************************************
		default:				//错码了，归零
			number = 0;
			break;
	}
}


